#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=86ad2c8f-b41a-4a06-ad81-a2b6c51bbb0f]
module.keycloak_dev.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6030c6f8-c209-4a1f-91e4-11f2fdf2a915]
module.keycloak_dev.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f3cc3d8a-9ee3-4d88-92be-dd2fda53843c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7302304e-4c40-47f9-9da0-bdff8e0553e2]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ae671e67-97e8-4b38-8f19-df1556cc24eb]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ae454372-19c8-4093-87b5-154ad6f86588]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0652ce91-1e75-42ce-8966-465816dc9ad9]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=b83ebb29-7401-4cab-9251-875c00611c7d]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=cb52b8da-11cd-4fe7-a4a5-de06310c7e19]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a12d229c-f65f-49f5-b1a0-4bebda10e03c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=62986da8-6133-421e-bed4-14cd0bb9f48e]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_openid_client.this: Refreshing state... [id=d9ea1689-ab66-4bdd-82d6-19e31007b2b5]
module.keycloak_dev.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4e041f99-35e2-491a-acfc-5747b5ec26d8]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidtest-5446.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=10a6448d-c0c5-4e16-9eab-e2a3a72e0ad3]
module.keycloak_dev.module.onestopauth.module.client_junmin-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd3f1f88-d319-4141-94c9-e7f8cff2fe30]
module.keycloak_dev.module.onestopauth.module.client_junmin-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e5e88ca1-1a29-46a2-a485-c1c7b95f00c5]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6f59d5e7-b118-461d-97c7-cbcba6290356]
module.keycloak_dev.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=9244f834-041a-4141-8594-a0ec0f87f880]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=07ba0da1-dc37-450a-afb5-daef9551eb7e]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=88e90e9e-9922-4a2f-91e1-8448f5df613c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=044874c2-6431-48ae-8406-6f7b8458a0e3]
module.keycloak_dev.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=10a3e50b-66b2-463f-a037-27641c4f27af]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1262b864-ed54-459b-b135-4cb8286d3554]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=1505ede9-97cb-4b02-951e-57b9c006331b]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=18510fcb-ee80-41fb-92c3-d157d51ae5bc]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=33b536c5-c7e8-47e1-8ff6-1f09709b32ec]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8594b13a-9c12-4390-94f5-7ba0d0050a91]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=57b3f858-b7ef-4126-8e0d-bc5605c0504c]
module.keycloak_dev.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2abfc8ea-05f6-4aeb-b0c4-ef87535b9b83]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7915bc73-ef3a-466e-b682-ed5cd19a6daa]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c3f970ba-ca17-41d6-9d1b-82d93b2c0f73]
module.keycloak_dev.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=ba18e180-0099-4682-a1f7-fa666f361ce9]
module.keycloak_dev.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=debc721c-9a10-4627-a70d-ff652722f343]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ee6a86a2-5463-4c19-8c67-534ceeca5b54]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=99c79e30-cb9b-42fa-bfd9-caf161c67729]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9cd98501-8ecc-496c-891f-57bfcf588b33]
module.keycloak_dev.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=51ae2f04-f5a2-4869-bdb7-e7ca5a76c8a7]
module.keycloak_dev.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9f2e5973-1f40-406e-98bd-f06edfc7a4d7]
module.keycloak_dev.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1548130c-ee12-472e-9845-4aed9abc3f9a]
module.keycloak_dev.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1c26ee4c-a5c6-4ccd-bfc0-36888f023ecc]
module.keycloak_dev.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0596d31b-a23a-4dce-8092-ee65020f51d2]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=7d3b53b5-2eb8-46e8-8bd4-07379eebea72]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d41103f5-8c51-4a83-ae6e-8cf373d77148]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dfd4fc73-bdca-4d80-a2cf-830c64578465]
module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6c0252f9-423f-47b3-a7e4-530f772bdd35]
module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8a6cbab4-f80d-4251-bdd5-8db332d97ff9]
module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1490fb53-d535-4748-aa94-56625cc29b62]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2f825593-3ffc-45e3-a0dd-a7d5f61a031c]
module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b4c16169-bb29-4d85-94b0-e78825886711]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=388821f7-a530-4f6c-99ea-9cd695900f46]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=38014355-1b16-496d-ad27-43eb8516db81]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1a5a45fe-e20c-4a4e-b7df-e27df4edbb0a]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4ec7c321-b3c7-484d-b25d-b1b5f0b87da5]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e10a6e98-1292-4605-9c6b-ccf3838d712b]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6677d385-777e-4c8d-a5ee-594194b6d3de]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=77e7e184-f43b-4b75-9a53-07b51f233d13]
module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=18b27aaf-2063-4ebb-9bc0-cf591a598fed]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=dbcd40f7-b57e-448b-9668-93bed4daf83f]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=bfe0a642-272e-4dc6-bceb-c74311c94cef]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f4290d21-f42e-402d-83da-abc8d4041fdb]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=026e79a6-549b-4d4a-985f-ca82c23927a2]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=966222d7-7d28-4ad1-9f67-d9dda46754e4]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=1cbd40db-e353-40a4-a860-fad0423eb01a]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=75f152fc-ed9f-409d-bce8-0035c0d895c3]
module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=635e7b98-bb38-4259-b61f-80b709a7afd1]
module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1df968fd-634b-4617-82a3-5d92023b099c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5fbabd38-1d26-44f9-8086-9b675782ebad]
module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a36bcc19-e38e-4dc4-8057-fdd0df8aaf1c]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1c0d6ed1-4c9c-4d2e-b6ec-6cb3bcd69066]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=09da8d35-2321-41e1-8426-6537bd712ae7]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=802cd761-f519-45cc-97d4-024e3cb7f8b7]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7a049900-08f0-455d-8e60-117d6b1b65e8]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fc75240d-2577-4ef3-9b83-67a00b42ec3b]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2f7e3930-cf59-430e-a675-78cfb092d685]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=893c5928-8dcf-407c-954c-147df4dbbec6]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=fdd1b368-149a-4755-899c-397f192c302d]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f9f98243-d304-4942-9acb-1f529fee9b82]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7af5bb55-d337-43fe-b601-35dfceb6b9ce]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b3a2ad3e-de7d-4181-bfd5-3f883f0f7620]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300a9df0-f7f6-48d2-b0d3-bfc1cfeabbc3]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5ea88be0-05eb-4cb4-b2d5-611e99f35b30]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=203caf5b-7262-4a5e-95e1-2016477c08ce]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=bde3707f-383d-4d20-a79d-e4c4f7931b1f]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-single-member-4524.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0398d20a-087c-487a-b2f8-0d1034df4fbd]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-single-member-4524.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e24386da-c3a0-4567-a9dd-63fc245e87c6]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-single-member-4524.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a0f6f4d5-d474-4f34-8d3e-2c002c404641]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-single-member-4524.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ba96189a-58e2-4e44-a6c0-a59a84eb5108]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-single-member-4524.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=88df8f0b-f83a-4682-a79f-d71086f85938]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-single-member-4524.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2ed18f1f-5e16-4f43-9bed-d570cd81c4e7]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-single-member-4524.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=903e7a19-5a3c-42be-a004-7d2facd8a57a]
module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-single-member-4524.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c5158e07-c72a-4b1e-b720-12077d64b313]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4f8be9c3-6b41-4bfd-8c22-203391a135d5]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=16484d85-e7b3-4be0-8c7c-6f204a3da0eb]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=15d88449-bc0d-426e-81b0-6a4695f26aac]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b24fc842-4228-4c11-bfda-725ff2e436dd]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a3b88f38-15dc-4b4a-baec-c6579630644c]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f9d3716d-da09-47ea-8673-9231e14bb31b]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=96b39fd8-c1c8-42f4-bb64-b767e67e44c9]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=c543e7e2-a624-44fa-a5cb-37d8b5da2cdf]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=58fa0b6a-e5bc-4425-83a5-a6d702ca3276]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_business.module.client_tians-testing-b-ce-id-dev-test-and-prod-5514.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "tians-testing-b-ce-id-dev-test-and-prod-5514"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_tians-testing-b-ce-id-dev-test-and-prod-5514.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_tians-testing-b-ce-id-dev-test-and-prod-5514.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_tians-testing-b-ce-id-dev-test-and-prod-5514.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_tians-testing-b-ce-id-dev-test-and-prod-5514.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "tians-testing-b-ce-id-dev-test-and-prod-5514"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_tians-testing-b-ce-id-dev-test-and-prod-5514.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_tians-testing-b-ce-id-dev-test-and-prod-5514.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_tians-testing-b-ce-id-dev-test-and-prod-5514.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_tians-testing-b-ce-id-dev-test-and-prod-5514.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "tians-testing-b-ce-id-dev-test-and-prod-5514"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "tians-testing-b-ce-id-dev-test-and-prod-5514"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-business"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://testDev",
        ]
      + web_origins                              = [
          + "+",
          + "https://testDev",
        ]
    }

  # module.keycloak_test.module.onestopauth_business.module.client_tians-testing-b-ce-id-dev-test-and-prod-5514.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "tians-testing-b-ce-id-dev-test-and-prod-5514"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_tians-testing-b-ce-id-dev-test-and-prod-5514.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_tians-testing-b-ce-id-dev-test-and-prod-5514.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_tians-testing-b-ce-id-dev-test-and-prod-5514.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_tians-testing-b-ce-id-dev-test-and-prod-5514.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "tians-testing-b-ce-id-dev-test-and-prod-5514"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_tians-testing-b-ce-id-dev-test-and-prod-5514.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_tians-testing-b-ce-id-dev-test-and-prod-5514.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_tians-testing-b-ce-id-dev-test-and-prod-5514.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_tians-testing-b-ce-id-dev-test-and-prod-5514.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "tians-testing-b-ce-id-dev-test-and-prod-5514"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "tians-testing-b-ce-id-dev-test-and-prod-5514"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-business"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://testTest",
        ]
      + web_origins                              = [
          + "+",
          + "https://testTest",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3564 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*